; domain
(define (domain lunar)
    (:requirements :strips :typing)

    ; -------------------------------
    ; Types
    ; -------------------------------

    ; EXAMPLE

    ; (:types
    ;     parent_type
    ;     child_type - parent_type

    ; )
    (:types
        equipment
        rover - equipment
        lander - equipment
        location
        data
        scan - data
        image - data
        sample
    )

    ; -------------------------------
    ; Predicates
    ; -------------------------------

    ; EXAMPLE

    ; (:predicates
    ;     (no_arity_predicate)
    ;     (one_arity_predicate ?p - parameter_type)
    ; )

    (:predicates
        (is_landed ?lan - lander) ;Whether a lander is landed or not.
        (on_position ?e - equipment ?l - location) ;Whether an equipment is on a certain location or not.
        (is_connected ?l1 - location ?l2 - location) ;Whether two locations are connected or not.
        (need_image ?l - location ?i - image) ;This location needs take an image
        (need_sample ?l - location ?s - sample) ;This location needs take a sample
        (need_scan ?l - location ?sc - scan) ;This location needs take a scan
        (captured_data ?r - rover ?d - data) ;Rover r has captured data (image,scan).
        (collected_sample ?r - rover ?s - sample) ; Rover r has collected a sample.
        (empty_memory ?r - rover) ;Rover r has empty memory.
        (hand_empty ?r - rover);Rover r has empty hand.
        (is_full ?lan - lander) ;Lander is full with samples
        (has_received ?d - data);Data has been received.
        (sample_got ?s - sample);Sample has been received.
        (association ?lan - lander ?r - rover);Lander is associated with the rover.
    )

    ; -------------------------------
    ; Actions
    ; -------------------------------

    ; EXAMPLE

    ; (:action action-template
    ;     :parameters (?p - parameter_type)
    ;     :precondition (and
    ;         (one_arity_predicate ?p)
    ;     )
    ;     :effect 
    ;     (and 
    ;         (no_arity_predicate)
    ;         (not (one_arity_predicate ?p))
    ;     )
    ; )

    (:action lander_land 
        :parameters (?lan - lander ?r - rover ?l - location)
        :precondition 
        (and
            (not (is_landed ?lan))
            )
        :effect 
        (and
            (is_landed ?lan)
            (on_position ?lan ?l)
            (on_position ?r ?l)
        )
    )
    
    (:action rover_move
        :parameters (?l1 - location ?l2 - location ?r - rover)
        :precondition
        (and
            (not (on_position ?r ?l2))
            (on_position ?r ?l1)
            (is_connected ?l1 ?l2)
        )
        :effect
        (and
            (not (on_position ?r ?l1))
            (on_position ?r ?l2)
        )
    )
    
    (:action take_picture
        :parameters (?r - rover ?l - location ?i - image)
        :precondition
        (and
            (on_position ?r ?l)
            (need_image ?l ?i)
            (empty_memory ?r)
        )
        :effect
        (and
            (not (empty_memory ?r))
            (not (need_image ?l ?i))
            (captured_data ?r ?i)
        )
    )
    
    (:action take_scan
        :parameters (?r - rover ?l - location ?sc - scan)
        :precondition
        (and
            (on_position ?r ?l)
            (need_scan ?l ?sc)
            (empty_memory ?r)
        )
        :effect
        (and
            (not (empty_memory ?r))
            (not (need_scan ?l ?sc))
            (captured_data ?r ?sc)
        )   
    )
    
    (:action take_sample
        :parameters (?r - rover ?l - location ?s - sample)
        :precondition
        (and
            (on_position ?r ?l)
            (need_sample ?l ?s)
            (hand_empty ?r)
            
            
        )
        :effect
        (and
            (not (need_sample ?l ?s))
            (not (hand_empty ?r))
            (collected_sample ?r ?s)
        )
    )
    
    (:action transmit_data
        :parameters (?r - rover ?d - data)
        :precondition (and 
            (captured_data ?r ?d)
            (not (has_received ?d))
        ) 
        :effect (and
            (not (captured_data ?r ?d))
            (has_received ?d)
            (empty_memory ?r)
        )
    )
    
    (:action sample_receive
        :parameters (?lan - lander ?r - rover ?s - sample ?l - location)
        :precondition (and
            (not (is_full ?lan))
            (on_position ?r ?l)
            (on_position ?lan ?l)
            (association ?lan ?r)
            (collected_sample ?r ?s)
         )
        :effect (and 
            (is_full ?lan)
            (not (collected_sample ?r ?s))
            (hand_empty ?r)
            (sample_got ?s)
        )
    )
    

        )

; problem
(define (problem lunar-mission-2)
    (:domain lunar)

    (:objects
        WP1 - location
        WP2 - location
        WP3 - location
        WP4 - location
        WP5 - location
        WP6 - location
        lander1 - lander
        lander2 - lander
        rover1 - rover
        rover2 - rover
        image1 - image
        image2 - image
        scan1 - scan
        scan2 - scan
        sample1 - sample
        sample2 - sample
    )

    (:init
        (is_connected WP1 WP2)
        (is_connected WP2 WP1)
        (is_connected WP2 WP3)
        (is_connected WP2 WP4)
        (is_connected WP4 WP2)
        (is_connected WP3 WP5)
        (is_connected WP5 WP3)
        (is_connected WP5 WP6)
        (is_connected WP6 WP4)
        (hand_empty rover1)
        (hand_empty rover2)
        (empty_memory rover1)
        (empty_memory rover2)
        (is_landed lander1)
        (on_position lander1 WP2)
        (on_position rover1 WP2)
        (not (is_landed lander2))
        (need_image WP3 image1)
        (need_image WP2 image2)
        (need_scan WP4 scan1)
        (need_scan WP6 scan2)
        (need_sample WP5 sample1)
        (need_sample WP1 sample2)
        (association lander1 rover1)
        (association lander2 rover2)
    )
    (:goal
        (and
            (has_received image1)
            (has_received image2)
            (has_received scan1)
            (has_received scan2)
            (sample_got sample1)
            (sample_got sample2)
        )
    )
)

; plan
1. (rover_move wp2 wp1 rover1)
   deleted: (on_position rover1 wp2)
   added: (on_position rover1 wp1)
   goals met: 0 of 6
2. (take_sample rover1 wp1 sample2)
   deleted: (need_sample wp1 sample2) (hand_empty rover1)
   added: (collected_sample rover1 sample2)
   goals met: 0 of 6
3. (lander_land lander2 rover2 wp5)
   added: (is_landed lander2) (on_position lander2 wp5) (on_position rover2 wp5)
   goals met: 0 of 6
4. (take_sample rover2 wp5 sample1)
   deleted: (need_sample wp5 sample1) (hand_empty rover2)
   added: (collected_sample rover2 sample1)
   goals met: 0 of 6
5. (sample_receive lander2 rover2 sample1 wp5)
   deleted: (collected_sample rover2 sample1)
   added: (is_full lander2) (hand_empty rover2) (sample_got sample1)
   goals met: 1 of 6
6. (rover_move wp5 wp6 rover2)
   deleted: (on_position rover2 wp5)
   added: (on_position rover2 wp6)
   goals met: 1 of 6
7. (take_scan rover2 wp6 scan2)
   deleted: (empty_memory rover2) (need_scan wp6 scan2)
   added: (captured_data rover2 scan2)
   goals met: 1 of 6
8. (rover_move wp1 wp2 rover1)
   deleted: (on_position rover1 wp1)
   added: (on_position rover1 wp2)
   goals met: 1 of 6
9. (sample_receive lander1 rover1 sample2 wp2)
   deleted: (collected_sample rover1 sample2)
   added: (is_full lander1) (hand_empty rover1) (sample_got sample2)
   goals met: 2 of 6
10. (take_picture rover1 wp2 image2)
   deleted: (empty_memory rover1) (need_image wp2 image2)
   added: (captured_data rover1 image2)
   goals met: 2 of 6
11. (rover_move wp6 wp4 rover2)
   deleted: (on_position rover2 wp6)
   added: (on_position rover2 wp4)
   goals met: 2 of 6
12. (rover_move wp2 wp3 rover1)
   deleted: (on_position rover1 wp2)
   added: (on_position rover1 wp3)
   goals met: 2 of 6
13. (transmit_data rover1 image2)
   deleted: (captured_data rover1 image2)
   added: (has_received image2) (empty_memory rover1)
   goals met: 3 of 6
14. (take_picture rover1 wp3 image1)
   deleted: (empty_memory rover1) (need_image wp3 image1)
   added: (captured_data rover1 image1)
   goals met: 3 of 6
15. (transmit_data rover1 image1)
   deleted: (captured_data rover1 image1)
   added: (has_received image1) (empty_memory rover1)
   goals met: 4 of 6
16. (transmit_data rover2 scan2)
   deleted: (captured_data rover2 scan2)
   added: (has_received scan2) (empty_memory rover2)
   goals met: 5 of 6
17. (take_scan rover2 wp4 scan1)
   deleted: (empty_memory rover2) (need_scan wp4 scan1)
   added: (captured_data rover2 scan1)
   goals met: 5 of 6
18. (transmit_data rover2 scan1)
   deleted: (captured_data rover2 scan1)
   added: (has_received scan1) (empty_memory rover2)
   goals met: 6 of 6
